use encoding::{Encoding, all::ISO_8859_1};

pub fn encode_string(text: &str) -> Vec<u8> {
    text.chars().map(encode_char).collect()
}

fn encode_char(c: char) -> u8 {
    let byte = match c {
        'Š' => 128,
        'š' => 129,
        'Ž' => 130,
        'ž' => 131,
        'Ć' => 132,
        'ć' => 133,
        'Č' => 134,
        'č' => 135,
        '▒' => 136,
        'ą' => 137,
        'Ď' => 138,
        'ď' => 139,
        'Ś' => 140,
        'Ť' => 141,
        'Ż' => 142,
        'Ź' => 143,
        'ę' => 144,
        'ě' => 145,
        'Ł' => 146,
        'ł' => 147,
        'ń' => 148,
        'Ň' => 149,
        'ň' => 150,
        'Ř' => 151,
        'ř' => 152,
        'ů' => 153,
        ' ' => 154,
        'ś' => 156,
        'ť' => 157,
        'ż' => 158,
        'ź' => 159,
        _ => c as u8
    };

    println!("Char: {c}, byte: {byte}");
    return byte;
}

pub fn decode_string(data: &[u8]) -> String {
    data.iter().map(decode_char).collect()
}

fn decode_char(byte: &u8) -> char {
    match byte {
        128 => 'Š',
        129 => 'š',
        130 => 'Ž',
        131 => 'ž',
        132 => 'Ć',
        133 => 'ć',
        134 => 'Č',
        135 => 'č',
        136 => '▒',
        137 => 'ą',
        138 => 'Ď',
        139 => 'ď',
        140 => 'Ś',
        141 => 'Ť',
        142 => 'Ż',
        143 => 'Ź',
        144 => 'ę',
        145 => 'ě',
        146 => 'Ł',
        147 => 'ł',
        148 => 'ń',
        149 => 'Ň',
        150 => 'ň',
        151 => 'Ř',
        152 => 'ř',
        153 => 'ů',
        154 => ' ',
        155 => ' ',
        156 => 'ś',
        157 => 'ť',
        158 => 'ż',
        159 => 'ź',
        _ => char::from_u32((ISO_8859_1.index_forward)(*byte).into()).unwrap_or_else(|| ' '),
    }
}
