use encoding::all::ISO_8859_1;

pub fn decode_string(data: &[u8]) -> String {
    data.iter().map(decode_char).collect()
}

fn decode_char(byte: &u8) -> char {
    match byte {
        128 => 'Š',
        129 => 'š',
        130 => 'Ž',
        131 => 'ž',
        132 => 'Ć',
        133 => 'ć',
        134 => 'Č',
        135 => 'č',
        136 => '▒',
        137 => 'ą',
        138 => 'Ď',
        139 => 'ď',
        140 => 'Ś',
        141 => 'Ť',
        142 => 'Ż',
        143 => 'Ź',
        144 => 'ę',
        145 => 'ě',
        146 => 'Ł',
        147 => 'ł',
        148 => 'ń',
        149 => 'Ň',
        150 => 'ň',
        151 => 'Ř',
        152 => 'ř',
        153 => 'ů',
        154 => ' ',
        155 => ' ',
        156 => 'ś',
        157 => 'ť',
        158 => 'ż',
        159 => 'ź',
        _ => char::from_u32((ISO_8859_1.index_forward)(*byte).into()).unwrap_or_else(|| ' '),
    }
}
